app/views/questions/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  ORDER BY "answers"."created_at" DESC  [["question_id", 4]]
---
  <strong>answer:</strong>
  <% @question.answers.each do |ans| %>