app/controllers/answers_controller.rb

  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.create(answer_params)
    @answer.user_id = current_user.id
    respond_to do |format|
      if @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "answers" ("content", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "grr"], ["question_id", 4], ["created_at", "2017-07-29 03:34:51.331159"], ["updated_at", "2017-07-29 03:34:51.331159"]]
UPDATE "answers" SET "user_id" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["user_id", 3], ["updated_at", "2017-07-29 03:34:51.392416"], ["id", 13]]

    def set_answer
      @answer = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 14]]