app/controllers/questions_controller.rb

  def show
    @answer = Answer.where(question_id: params[:question_id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  ORDER BY "answers"."created_at" DESC  [["question_id", 4]]

  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "qwertykk"], ["content", "nbvcxz"], ["user_id", 3], ["created_at", "2017-07-29 03:34:36.517935"], ["updated_at", "2017-07-29 03:34:36.517935"]]

  def destroy
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 10]]